1622542013/YunHua-DTC-ARM3-FreeRTOS/SYSTEM/NetWork-licheng/ETH_STM32F4xx.c
/*
*********************************************************************************************************
*
*	模块名称 : STM32F4XX的MAC驱动
*	文件名称 : ETH_STM32F4XX.C
*	版    本 : V2.0
*	说    明 : 由官方的驱动修改而来。
*              1. 原始驱动支持DP83848C 和ST802RT1，修改为仅支持DM9161/9162，方便驱动的规范化。
*              2. 增加PHY的中断触发功能，主要用于检测网线的连接状态。
*              3. 变量g_ucEthLinkStatus用于表示连接状态。
*                         
*	修改记录 :
*		版本号    日期         作者            说明
*       V1.0    2015-12-22    Eric2013         首发
*       V2.0    2017-04-17    Eric2013         整理，并使其规范化
*
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include <Net_Config.h>
#include <stm32f4xx.h>             
#include "ETH_STM32F4xx.h"
#include "stdio.h"
#include "USART.h"

#include "usr_FreeRTOS.h"
/*
*********************************************************************************************************
*	                  	STM32-V5开发板使用的是RMII接口，PHY芯片是DM9161/9162                            
*********************************************************************************************************
*/
/*
	PA1/ETH_RMII_RX_CLK
	PA2/ETH_MDIO
	PA7/RMII_CRS_DV
	PC1/ETH_MDC
	PC4/ETH_RMII_RX_D0
	PC5/ETH_RMII_RX_D1
	PG11/ETH_RMII_TX_EN
	PG13/FSMC_A24/ETH_RMII_TXD0
	PG14/ETH_RMII_TXD1
	PH6/MII_INT ----- 中断引脚,这里将其用于网线断开或者连接的状态触发
*/


/*
*********************************************************************************************************
*	                                  用于本文件的调试
*********************************************************************************************************
*/
#if 1
	#define printf_eth printf
#else
	#define printf_eth(...)
#endif


/*
*********************************************************************************************************
*	                                     宏定义
*********************************************************************************************************
*/
/* 
  默认情况下，我们选择是自动识别，即使用PHY芯片支持的Auto-Negotiation实现自适应10Mbps网络或者100Mbps网络
  但是这种时间稍长，如果用户确定了使用的网络是10Mbps还是100Mbps，直接通过下面的宏定义选择即可，如果使用的
  自适应，两个都不需要选择。
*/
//#define  _10MBIT_
//#define  _100MBIT_


/*
*********************************************************************************************************
*	                                     变量
*********************************************************************************************************
*/
__IO uint8_t  g_ucEthLinkStatus = 0;  /* 以太网连接状态，0 表示未连接，1 表示连接 */

extern U8 own_hw_adr[];  /* 在文件Net_Config.c里面定义 */

static U8 TxBufIndex;
static U8 RxBufIndex;

static RX_Desc Rx_Desc[NUM_RX_BUF];  /* DMA接收描述符 */
static TX_Desc Tx_Desc[NUM_TX_BUF];  /* DMA发送描述符 */

static U32 rx_buf[NUM_RX_BUF][ETH_BUF_SIZE>>2]; /* DMA接收描述符缓冲 */
static U32 tx_buf[NUM_TX_BUF][ETH_BUF_SIZE>>2]; /* DMA发送描述符缓冲 */


/*
*********************************************************************************************************
*	                                     变量
*********************************************************************************************************
*/
/*
  底层驱动有两种方式，一种是查询的，一种是中断的，我们这里是采用的中断方式。
  a. 查询方式需要的函数: - void init_ethernet ()
                         - void send_frame (OS_FRAME *frame)
                         - void poll_ethernet (void)
  b. 中断方式需要的函数: - void init_ethernet ()
                         - void send_frame (OS_FRAME *frame)
                         - void int_enable_eth ()
                         - void int_disable_eth ()
                         - interrupt function 
 */

static void rx_descr_init (void);
static void tx_descr_init (void);
static void write_PHY (U32 PhyReg, U16 Value);
static U16  read_PHY (U32 PhyReg);
static void Eth_Link_EXTIConfig(void);


/*
*********************************************************************************************************
*	函 数 名: init_ethernet
*	功能说明: 初始化以太网RMII方式引脚，驱动PHY，配置MAC及其DMA方式。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#include "usart.h"
#include "delay.h"
void init_ethernet (void) 
{
	U32 regv,tout,conn; 

	/* 关闭PHY中断触发引脚 */
	NVIC_DisableIRQ(EXTI9_5_IRQn);

	/* 使能系统配置控制器时钟 */
	RCC->APB2ENR |= (1 << 14);

	/* 复位以太网MAC */
	RCC->AHB1RSTR |=  0x02000000;

	/* 选择RMII接口，必须在 MAC 处于复位状态且在使能 MAC 时钟之前完成此配置 */
	SYSCFG->PMC |=  (1 << 23);

	/* 停止复位以太网MAC */
	RCC->AHB1RSTR &= ~0x02000000;

  GPIO_InitTypeDef GPIO_InitStructure;
  
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA|RCC_AHB1Periph_GPIOC|RCC_AHB1Periph_GPIOG|RCC_AHB1Periph_GPIOD, ENABLE);//使能GPIO时钟 RMII接口
	  //配置PA1 PA2 PA7
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;  
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH); //引脚复用到网络接口上
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH);

	//配置PC1,PC4 and PC5
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH); //引脚复用到网络接口上
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);
                                
	//配置PG11, PG14 and PG13 
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11 | GPIO_Pin_13 | GPIO_Pin_14;
	GPIO_Init(GPIOG, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOG, GPIO_PinSource11, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOG, GPIO_PinSource13, GPIO_AF_ETH);
	GPIO_PinAFConfig(GPIOG, GPIO_PinSource14, GPIO_AF_ETH);
	
	//配置PD3为推完输出
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;	//推完输出
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;  
	GPIO_Init(GPIOD, &GPIO_InitStructure);          
  
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx |RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  
