1622542013/YunHua-DTC-ARM3-FreeRTOS/SYSTEM/NetWork-licheng/ETH_STM32F4xx.c
  GPIO_ResetBits(GPIOD, GPIO_Pin_3);
  
  Delay_ms(50);
   
  GPIO_SetBits(GPIOD, GPIO_Pin_3);
  
	/* 
	  寄存器ETH->DMABMR的SR位置1后，MAC DMA控制器会复位所有MAC子系统的内部寄存器和逻辑。在所有内
	  核时钟域完成复位操作后，该位自动清零。重新编程任何内核寄存器之前，在该位中读取0 值。
	*/
	ETH->DMABMR  |= DBMR_SR;
	while (ETH->DMABMR & DBMR_SR);
	conn = 0;

	/* 
	   HCLK的时钟是168MHz，这里选项CR位为100，CR占用寄存器ETH->MACMIIAR的bit4，bit3和bit2。
	   CR 时钟范围选项可确定 HCLK 频率并用于决定 MDC 时钟频率：
	    选项     HCLK        MDC 时钟
	    000    60-100MHz     HCLK/42
		001    100-150MHz    HCLK/62
		010    20-35MHz      HCLK/16
		011    35-60MHz      HCLK/26
		100    150-168MHz    HCLK/102
		101、110、111 保留
    */
	ETH->MACMIIAR = 0x00000010;

//	/*
//	  注意事项：DM9161可以上电后就读取其ID寄存器，但是DM9162不行，需要延迟一段时间这里为了方便起见，
//	  直接将其复位，发送复位指令可以立即执行。
//	*/
//	/* 第1步：复位DM9161/9162 ***********************************************************/
//	printf_eth("===============================================================\r\n");
//	printf_eth("下面是DM9161/9162的硬件初始化：\r\n");
//	printf_eth("1. Start PHY_ID_DM9161/9162 Init\r\n");

  u1_printf("下面是PHY的硬件初始化：\r\n");
	
	/* 发送复位命令 */
	write_PHY (PHY_REG_BMCR, 0x8000);

	/* 等待复位完成 */
	for (tout = 0; tout < 0x10000; tout++) 
	{
		regv = read_PHY (PHY_REG_BMCR);
		if (!(regv & 0x8800)) 
		{
      u1_printf("复位完成\r\n");
			/* 复位完成 */
			break;
		}
	}

	/* 第2步：配置DM9161/9162 ***********************************************************/
#if defined (_10MBIT_)
	write_PHY (PHY_REG_BMCR, PHY_FULLD_10M);  /* 连接到10Mbps的网络 */
#elif defined (_100MBIT_)
	write_PHY (PHY_REG_BMCR, PHY_FULLD_100M); /* 连接到100Mbps的网络 */
#else
	/* 通过Auto-Negotiation实现自适应10Mbps网络或者100Mbps网络 */
	write_PHY (PHY_REG_BMCR, PHY_AUTO_NEG);
	
	/* 等待完成Auto-Negotiation */
	for (tout = 0; tout < 0xF00000; tout++) 
	{
		regv = read_PHY (PHY_REG_BMSR);
		if (regv & 0x0020) 
		{
      u1_printf("完成自适应设置\r\n");
			/* 完成Auto-Negotiation */
			break;
		}
	}
#endif
	
	/* 第3步：检测连接状态 ***********************************************************/
	for (tout = 0; tout < 0xF0000; tout++) 
	{
		regv = read_PHY (PHY_REG_BMSR);
		if (regv & (1 << 2)) 
		{
      u1_printf("连接成功\r\n");
			
			/* PHY已经连接上网络 */ 
			g_ucEthLinkStatus = 1;
			
			/* 获取连接信息 */
			regv = read_PHY (PHY_REG_DSCSR);
			
			if ((regv & (1 << 15))|(regv & (1 << 13))) 
			{
        u1_printf("全双工\r\n");
				/* 全双工 */
				conn |= PHY_CON_SET_FULLD;
			}
			
			if ((regv & (1 << 15))|(regv & (1 << 14))) 
			{
        u1_printf("速度100Mbps的网络\r\n");
				/* 速度100Mbps的网络 */

				conn |= PHY_CON_SET_100M;
			}
			break;
		}
		else
		{
      u1_printf("连接失败\r\n");
			
			/* 未连接上 */ 
			g_ucEthLinkStatus = 0;
		}
	}

	/* 第4步：使能DM9161/9162中断 ***********************************************************/
	/* 使能DM9161/9162的连接中断 */
	write_PHY (PHY_REG_INTERRUPT, 1<<12);

	/* 配置引脚PH6来接收中断信号 */
	Eth_Link_EXTIConfig();

	/* 第5步：使能DM9161/9162中断 ***********************************************************/	
	/* 
	   初始化MAC配置寄存器
	   （1）当该位MCR_ROD置1时，MAC禁止在半双工模式下接收帧。
	   （2）当该位MCR_ROD清0时，MAC接收PHY发送的所有数据包。
	   （3）如果MAC在全双工模式下工作，该位不适用。
	*/
	ETH->MACCR  = MCR_ROD;

	/* 设置MAC工作在全双工模式 */
	if (conn & PHY_CON_SET_FULLD) 
	{
		/* 使能全双工 */
		ETH->MACCR |= MCR_DM;
	}

	/* 
		通过位MCR_FES配置MAC通信速度
		（1）0表示10Mbps
		（2）1表示100Mbps
	*/
	if (conn & PHY_CON_SET_100M) 
	{
		/* 配置为100Mbps */
		ETH->MACCR |= MCR_FES;
	}

	/* MACFFR 以太网帧过滤寄存器，配置可接收所有MAC组播包，即MAC地址第一个字节的bit0 = 1 */
	ETH->MACFFR = MFFR_HPF | MFFR_PAM;
	
	/* MACFCR 以太网流控制寄存器，ZQPD零时间片暂停禁止 */
	ETH->MACFCR = MFCR_ZQPD;

	/* 设置以太网MAC地址寄存器 */
	ETH->MACA0HR = ((U32)own_hw_adr[5] <<  8) | (U32)own_hw_adr[4];
	ETH->MACA0LR = ((U32)own_hw_adr[3] << 24) | (U32)own_hw_adr[2] << 16 |
				   ((U32)own_hw_adr[1] <<  8) | (U32)own_hw_adr[0];

	/* 初始化DMA发送和接收描述符 */
	rx_descr_init ();
	tx_descr_init ();

	/* 
	    刷新FIFO，启动DMA发送和接收功能
		DMAOMR 工作模式寄存器
		位20 DOMR_FTF：刷新发送 FIFO (Flush transmit FIFO)：
		               该位置1时，发送FIFO控制器逻辑会复位为默认值，因此，TX FIFO中的所有数据均会
			           丢失/刷新。刷新操作结束时该位在内部清零。此位清零之前不得对工作模式寄存器执
			           行写操作。
		位13 DOMR_ST：启动/停止发送 (Start/stop transmission)
		              该位置1时，启动发送，DMA会检查当前位置的发送列表来查找待发送的帧。
		位1  DOMR_SR：启动/停止接收 (Start/stop receive)
		              该位置1时，启动接收，DMA尝试从接收列表中获取描述符并处理传入帧。
	*/
	ETH->DMAOMR = DOMR_FTF | DOMR_ST | DOMR_SR;

	/* 使能发送和接收 */
	ETH->MACCR |= MCR_TE | MCR_RE;

	/* 复位所有MAC中断 */
	ETH->DMASR  = 0xFFFFFFFF;

	/*  
	    使能发送和接收中断
		DMAIER 中断使能寄存器
		位16 NISE：使能所有正常中断(Normal interrupt summary enable)
		位15 AISE：使能所有异常中断(Abnormal interrupt summary enable)
		位7 RBUIE：接收缓冲区不可用中断使能(Receive buffer unavailable interrupt enable)
		           当该位和AISE位都置1后，可使能接收缓冲区不可用中断。该位清零时，会禁止接
				   收缓冲区不可用中断。
		位6   RIE：接收中断使能 (Receive interrupt enable)
		           当该位和AISE都置1后，可使能接收中断。该位清零时，会禁止接收中断。
	*/
	ETH->DMAIER = ETH_DMAIER_NISE | ETH_DMAIER_AISE | ETH_DMAIER_RBUIE | ETH_DMAIER_RIE;

	/* 设置为最高优先级，仅调用NVIC->ISER设置的默认优先级也是最高优先级0 */
	NVIC_SetPriority(ETH_IRQn, 1);
	
  u1_printf("初始化完成\r\n");

}

/*
*********************************************************************************************************
*	函 数 名: int_enable_eth
*	功能说明: 使能以太网中断
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void int_enable_eth (void) 
{
	NVIC->ISER[1] = 1 << 29;
}

/*
*********************************************************************************************************
*	函 数 名: int_disable_eth
*	功能说明: 使能以太网中断
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void int_disable_eth (void) 
{
	NVIC->ICER[1] = 1 << 29;
}

/*
*********************************************************************************************************
*	函 数 名: send_frame
*	功能说明: 传递数据帧给MAC DMA发送描述符，并使能发送。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void send_frame (OS_FRAME *frame) 
{
	U32 *sp,*dp;
	U32 i,j;

	j = TxBufIndex;
	
	/* 等待上一帧数据发送完成 */
	while (Tx_Desc[j].CtrlStat & DMA_TX_OWN);

	sp = (U32 *)&frame->data[0];
	dp = (U32 *)(Tx_Desc[j].Addr & ~3);

	/* 复制要发送的数据到DMA发送描述符中 */
	for (i = (frame->length + 3) >> 2; i; i--) 
	{
		*dp++ = *sp++;
	}
	
