1622542013/YunHua-DTC-ARM3-FreeRTOS/SYSTEM/NetWork-licheng/ETH_STM32F4xx.c
	/* 设置数据帧大小 */
	Tx_Desc[j].Size      = frame->length;
	
	/* 发送描述符由DMA控制发送 */
	Tx_Desc[j].CtrlStat |= DMA_TX_OWN;
	
	if (++j == NUM_TX_BUF) j = 0;
	TxBufIndex = j;
	
	/* 开始帧传输 */
	/* 
	   DMASR 以太网 DMA 状态寄存器
	   向ETH_DMASR寄存器[16:0]中的（未保留）位写入1会将其清零，写入 0 则不起作用。
	   位1 TPSS：发送过程停止状态 (Transmit process stopped status)
                 当发送停止时，此位置 1。
	*/
	ETH->DMASR   = DSR_TPSS;
	
	/*
	   DMATPDR 以太网DMA发送轮询请求寄存器
       应用程序使用此寄存器来指示DMA轮询发送描述符列表。
       位 31:0 TPD：发送轮询请求(Transmit poll demand)
                    向这些位写入任何值时，DMA都会读取ETH_DMACHTDR寄存器指向的当前描述符。如果
                    该描述符不可用（由CPU所有），则发送会返回到挂起状态，并将ETH_DMASR寄存器位2
                    进行置位。如果该描述符可用，则发送会继续进行。	   
	*/
	ETH->DMATPDR = 0;
	
	xEventGroupSetBits(Main_tcpnet_group,MAIN_TCP);
}

/*
*********************************************************************************************************
*	函 数 名: ETH_IRQHandler
*	功能说明: 以太网中断，主要处理从MAC DMA接收描述符接收到的数据帧以及错误标志的处理。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void ETH_IRQHandler (void) 
{
	OS_FRAME *frame;
	U32 i, RxLen;
	U32 *sp,*dp;

	i = RxBufIndex;
	
	/* 循环所有接受描述符列表，遇到未接收到数据的退出循环 */
	do 
	{
		/*
			#define DMA_RX_ERROR_MASK   (DMA_RX_ES | DMA_RX_LE | DMA_RX_RWT | \
								         DMA_RX_RE | DMA_RX_CE)
			
			有错误，放弃此帧数据，错误类型包含如下：
			位15 DMA_RX_ES：错误汇总(Error summary)，即CRC错误，接收错误，看门狗超时，延迟冲突等。
		    位12 DMA_RX_LE：长度错误(Length error)
		                    该位置1时，指示接收帧的实际长度与长度/类型字段的值不符。该字段仅在帧类
		                    型位(RDES0[5])复位后有效。
			位4 DMA_RX_RWT：接收看门狗超时 (Receive watchdog timeout)
		                    该位置1时，表示接收看门狗计时器在接收当前帧时超时，且当前帧在看门狗超
		                    时后被截断了
			位3 DMA_RX_RE： 接收错误 (Receive error)
                            该位置1时，表示在帧接收期间，当发出RX_DV信号时，会发出RX_ERR信号。
			位1 DMA_RX_CE： CRC 错误(CRC error)
                            该位置1时，表示接收的帧发生循环冗余校验(CRC)错误。只有最后一个描述符
		                    (RDES0[8])置1时，该字段才有效
		*/
		if (Rx_Desc[i].Stat & DMA_RX_ERROR_MASK)
		{
			goto rel;
		}
		
		/*
			#define DMA_RX_SEG_MASK   (DMA_RX_FS | DMA_RX_LS)
		    位9 FS：第一个描述符 (First descriptor)
                    该位置1时，指示此描述符包含帧的第一个缓冲区。如果第一个缓冲区的大小为0，则第二
                    个缓冲区将包含帧的帧头。如果第二个缓冲区的大小为0，则下一个描述符将包含帧的帧头。
		
		    位8 LS：最后一个描述符 (Last descriptor)
                    该位置1时，指示此描述符指向的缓冲区为帧的最后一个缓冲区。
		
		    下面的函数用于判断此帧数据是否只有一个缓冲，初始化接收描述符列表的时候，每个描述符仅设置了
		    一个缓冲。
		*/
		if ((Rx_Desc[i].Stat & DMA_RX_SEG_MASK) != DMA_RX_SEG_MASK) 
		{
			goto rel;
		}
		
		RxLen = ((Rx_Desc[i].Stat >> 16) & 0x3FFF) - 4;
		if (RxLen > ETH_MTU) 
		{
			/* 数据包太大，直接放弃 */
			goto rel;
		}
		
		/* 申请动态内存，RxLen或上0x80000000表示动态内存不足了不会调用函数sys_error() */
		frame = alloc_mem (RxLen | 0x80000000);
		
		/* 如果动态内存申请失败了，放弃此帧数据；成功了，通过函数put_in_queue存入队列中 */
		if (frame != NULL) 
		{
			sp = (U32 *)(Rx_Desc[i].Addr & ~3);
			dp = (U32 *)&frame->data[0];
			for (RxLen = (RxLen + 3) >> 2; RxLen; RxLen--) 
			{
				*dp++ = *sp++;
			}
			put_in_queue (frame);
		}
		
		/* 设置此接收描述符继续接收新的数据 */
		rel: Rx_Desc[i].Stat = DMA_RX_OWN;

		if (++i == NUM_RX_BUF) i = 0;
	}
	while (!(Rx_Desc[i].Stat & DMA_RX_OWN));
	
	RxBufIndex = i;

	/*
	   DMASR DMA的状态寄存器（DMA status register）
	   位7 RBUS：接收缓冲区不可用状态 (Receive buffer unavailable status)
                 此位指示接收列表中的下一个描述符由CPU所拥有，DMA无法获取。接收过程进入挂起状态。
	             要恢复处理接收描述符，CPU应更改描述符的拥有关系，然后发出接收轮询请求命令。如果
	             未发出接收轮询请求命令，则当接收到下一个识别的传入帧时，接收过程会恢复。仅当上一
	             接收描述符由DMA所拥有时，才能将ETH_DMASR[7]置1。
	
	   DMAIER的接收缓冲区不可用中断RBUIE是bit7，对于的接收缓冲区不可用状态在DMA状态寄存器中也是bit7。
	*/
	if (ETH->DMASR & INT_RBUIE) 
	{
		/* 接收缓冲区不可用，重新恢复DMA传输 */
		ETH->DMASR = ETH_DMASR_RBUS;
		ETH->DMARPDR = 0;
	}
	
	/* 
	   DMASR DMA的状态寄存器（DMA status register）
	   这里实现清除中断挂起标志 
	   位16 ETH_DMASR_NIS：所有正常中断 (Normal interrupt summary)
	   位15 ETH_DMASR_AIS：所有异常中断 (Abnormal interrupt summary)
	   位6  ETH_DMASR_RS ：接收状态 (Receive status)
	                       此位指示帧接收已完成，具体的帧状态信息已经包含在描述符中，接收仍保持运行状态。
	*/
	ETH->DMASR = ETH_DMASR_NIS | ETH_DMASR_AIS | ETH_DMASR_RS;
	
	
	BaseType_t set_maintcp_status;
	BaseType_t isr_group = pdFALSE;
	
	set_maintcp_status = xEventGroupSetBitsFromISR(Main_tcpnet_group,0x0001,&isr_group);
	
	if(set_maintcp_status != pdFALSE)
	{
		portYIELD_FROM_ISR(isr_group);
	}
}

/*
*********************************************************************************************************
*	函 数 名: rx_descr_init
*	功能说明: MAC DMA接收描述符初始化。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void rx_descr_init (void) 
{
	U32 i,next;

	/*
	   1. RDES0：接收描述符字0，对应Rx_Desc[i].Stat
	      位31 OWN：所有关系位 (Own bit)
					该位置1时，指示描述符由MAC子系统的DMA所拥有。
	                该位清零时，指示描述符由主机所拥有，即CPU。
	                DMA在帧接收完成或此描述符的关联缓冲区已满时将该位清零。
	
	   2. RDES1：接收描述符字1，对应Rx_Desc[i].Ctrl
	      位14   RCH： 链接的第二个地址 (Second address chained)
					   该位置1时，表示描述符中的第二个地址是下一个描述符地址，而非第二个缓冲区地址。该
                       位置1时，RBS2(RDES1[28:16])为无关值。RDES1[15]比RDES1[14]优先处理。
	      位12:0 RBS1：接收缓冲区1大小 (Receive buffer 1 size)
                       第一个数据缓冲区的大小以字节为单位。即使RDES2（缓冲区1地址指针）的值未对齐，缓
	                   冲区大小也必须为4、8或16的倍数，具体取决于总线宽度32、64或128。如果缓冲区大小不
	                   是4、8或16的倍数，这种情况的结果是未定义。如果该字段为0，则DMA会忽略该缓冲区并
	                   使用缓冲区2或下一个描述符，具体取决于RCH（位14）的值。
	
	   3. RDES2：接收描述符字2，对应Rx_Desc[i].Addr
	      位31:0 RBAP1/RTSL：接收缓冲区1地址指针/接收帧时间戳低位
		                     Receive buffer 1 address pointer
                             Receive frame time stamp low
	
	   4. RDES3：接收描述符字3，对应Rx_Desc[i].Next
	      位31:0 RBAP2/RTSH：接收缓冲区2地址指针（下一个描述符地址）/ 接收帧时间戳高位
		                     Receive buffer 2 address pointer (next descriptor address) 
		                     Receive frame time stamp high
	*/
	RxBufIndex = 0;
	
	for (i = 0, next = 0; i < NUM_RX_BUF; i++) 
	{
		if (++next == NUM_RX_BUF) next = 0;
		Rx_Desc[i].Stat = DMA_RX_OWN;
		Rx_Desc[i].Ctrl = DMA_RX_RCH | ETH_BUF_SIZE;
		Rx_Desc[i].Addr = (U32)&rx_buf[i];
		Rx_Desc[i].Next = (U32)&Rx_Desc[next];
	}
	
	/* 接收描述符列表地址寄存器指向接收描述符列表的起始处 */
	ETH->DMARDLAR = (U32)&Rx_Desc[0];
}

