1622542013/YunHua-DTC-ARM3-FreeRTOS/SYSTEM/NetWork-licheng/ETH_STM32F4xx.c
/*
*********************************************************************************************************
*	函 数 名: tx_descr_init
*	功能说明: MAC DMA发送描述符初始化
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void tx_descr_init (void) 
{
	U32 i,next;

	/*
	   1. TDES0：发送描述符字0，对应Tx_Desc[i].CtrlStat
	      位29 LS ：末段 (Last segment)
                    该位置1时，指示缓冲区中包含帧的末段。
	      位28 FS ：首段 (First segment)
                    该位置1时，指示缓冲区中包含帧的首段
          位20 TCH：链接的第二个地址 (Second address chained)
                    该位置1时，表示描述符中的第二个地址是下一个描述符地址，而非第二个缓冲区地址。
                    TDES0[20]置1时，TBS2(TDES1[28:16])为无关值。TDES0[21]比TDES0[20]优先处理。
	
	   2. TDES1：发送描述符字1，对应Tx_Desc[i].Size
	
	   3. TDES2：发送描述符字2，对应Tx_Desc[i].Addr
	      位31:0 TBAP1：发送缓冲区1地址指针/发送帧时间戳低位 
	                    Transmit buffer 1 address pointer / Transmitframe time stamp low
	
	   4. TDES3：发送描述符字3，对应Tx_Desc[i].Next
	      位 1:0 TBAP2：发送缓冲区2地址指针（下一个描述符地址）/ 发送帧时间戳高位
     		            Transmit buffer 2 address pointer (Next descriptor address) 
						Transmit frame time stamp high
	*/
	TxBufIndex = 0;
	for (i = 0, next = 0; i < NUM_TX_BUF; i++) 
	{
		if (++next == NUM_TX_BUF) next = 0;
		Tx_Desc[i].CtrlStat = DMA_TX_TCH | DMA_TX_LS | DMA_TX_FS;
		Tx_Desc[i].Addr     = (U32)&tx_buf[i];
		Tx_Desc[i].Next     = (U32)&Tx_Desc[next];
	}
	
	/* 发送描述符列表地址寄存器指向发送描述符列表的起始处 */
	ETH->DMATDLAR = (U32)&Tx_Desc[0];
}


/*
*********************************************************************************************************
*	函 数 名: write_PHY
*	功能说明: 写数据到PHY寄存器
*	形    参: PhyReg  PHY寄存器地址
*             Value   写入的数据
*	返 回 值: 无
*********************************************************************************************************
*/
static void write_PHY (U32 PhyReg, U16 Value)
{
	U32 tout;

	/* 数据寄存器，存入要写入PHY的16位数据 */
	ETH->MACMIIDR = Value;

	/*
	   MACMIIAR 以太网MAC MII 地址寄存器
       位 15:11 PA：PHY 地址 (PHY address)，对应这里的PHY_DEF_ADDR
					该字段指示正在访问32个可能的PHY器件中的哪一个。	
	   
	   位 10:6  MR：MII寄存器 (MII register)，对应这里的PhyReg
					这些位在所选的PHY器件中选择要访问的MII寄存器。
	   位 1     MW：MII写(MII write)，对应这里的MMAR_MW
	                此位置1是在告知PHY，将要启动一个使用MII数据寄存器的写操作。
	                如果此位未置，则表示会启动一个读操作，将数据放入MII数据寄存器。
	   位 0     MB：MII忙碌 (MII busy)，对应这里的MMAR_MB
	                向ETH_MACMIIAR和ETH_MACMIIDR写入前，此位应读取逻辑0。向ETH_MACMIIAR写入过程中，此
	                位也必须复位为0。在PHY寄存器访问过程中，此位由应用程序置1，指示读或写访问正在进行中。
	                在对PHY进行写操作过程中，ETH_MACMIIDR（MII数据）应始终保持有效，直到MAC将此位清零。
	                在对PHY进行读操作过程中，ETH_MACMIIDR始终无效，直到MAC将此位清零。在此位清零后，才
					可以向ETH_MACMIIAR（MII地址）写入。
	*/
	ETH->MACMIIAR = PHY_DEF_ADDR << 11 | PhyReg << 6 | MMAR_MW | MMAR_MB;

	/* 等待操作完成，即等待MMAR_MB位被清零 */
	tout = 0;
	for (tout = 0; tout < MII_WR_TOUT; tout++) 
	{
		if ((ETH->MACMIIAR & MMAR_MB) == 0) 
		{
			break;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: read_PHY
*	功能说明: 从PHY芯片中读取寄存器数据
*	形    参: PhyReg  寄存器地址
*	返 回 值: 无
*********************************************************************************************************
*/
static U16 read_PHY (U32 PhyReg) 
{
	U32 tout;

	/*
	   MACMIIAR 以太网MAC MII 地址寄存器
       位 15:11 PA：PHY 地址 (PHY address)，对应这里的PHY_DEF_ADDR
					该字段指示正在访问32个可能的PHY器件中的哪一个。	
	   
	   位 10:6  MR：MII寄存器 (MII register)，对应这里的PhyReg
					这些位在所选的PHY器件中选择要访问的MII寄存器。
	   位 1     MW：MII写(MII write)，对应这里的MMAR_MW
	                此位置1是在告知PHY，将要启动一个使用MII数据寄存器的写操作。
	                如果此位未置，则表示会启动一个读操作，将数据放入MII数据寄存器。
	   位 0     MB：MII忙碌 (MII busy)，对应这里的MMAR_MB
	                向ETH_MACMIIAR和ETH_MACMIIDR写入前，此位应读取逻辑0。向ETH_MACMIIAR写入过程中，此
	                位也必须复位为0。在PHY寄存器访问过程中，此位由应用程序置1，指示读或写访问正在进行中。
	                在对PHY进行写操作过程中，ETH_MACMIIDR（MII数据）应始终保持有效，直到MAC将此位清零。
	                在对PHY进行读操作过程中，ETH_MACMIIDR始终无效，直到MAC将此位清零。在此位清零后，才
					可以向ETH_MACMIIAR（MII地址）写入。
	*/
	ETH->MACMIIAR = PHY_DEF_ADDR << 11 | PhyReg << 6 | MMAR_MB;

	/* 等待操作完成，即等待MMAR_MB位被清零 */
	tout = 0;
	for (tout = 0; tout < MII_RD_TOUT; tout++) 
	{
		if ((ETH->MACMIIAR & MMAR_MB) == 0) 
		{
			break;
		}
	}
	
	/* 从 PHY 中读取16bit的数据值 */
	return (ETH->MACMIIDR & MMDR_MD);
}

/*
*********************************************************************************************************
*	函 数 名: Eth_Link_EXTIConfig
*	功能说明: PHY的中断触发使用STM32的PH6引脚识别，此功能主要用于检测网线的连接状态判别。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void Eth_Link_EXTIConfig(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	/* 安富莱STM32-V6开发板使用PH6作为中断输入口, 下降沿表示中断信号 */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	/* 配置中断引脚是输入 */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_Init(GPIOH, &GPIO_InitStructure);

	/* 配置外部中断线连接到相应引脚 */
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOH, EXTI_PinSource6);

	/* 配置外部中断线 */
	EXTI_InitStructure.EXTI_Line = EXTI_Line6;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	/* 使能中断通道 */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/*
*********************************************************************************************************
*	函 数 名: EXTI9_5_IRQHandler
*	功能说明: PH6引脚的中断处理
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#define ETH_CONSTATUS
#define ETH_CONNECT    "ETH_LINK Connect\r\n"
#define ETH_DISCONNECT "ETH_LINK Disconnect\r\n"
void EXTI9_5_IRQHandler(void)
{
	U32 regv, tout;
	
	if (EXTI_GetITStatus(EXTI_Line6) != RESET)
	{
		/* 可以考虑在此处加入延迟，有时连接状态变了，但是寄存器没有及时更新*/
		regv = read_PHY(PHY_REG_INTERRUPT);
		if(regv & (1 << 2))
		{
			/* 重新插入后要多读几次，保证寄存器BMSR被更新 */
			for(tout = 0; tout < 10; tout++) 
			{
				regv = read_PHY (PHY_REG_BMSR);
				if (regv & (1 << 2)) 
				{
					break;
				}
			}

			/* 连接上网线 */
			if(regv & (1 << 2)) 
			{
				#ifdef ETH_CONSTATUS
					const char *pError = ETH_CONNECT;
					uint8_t i;
				#endif
				
				g_ucEthLinkStatus = 1;
				
				#ifdef ETH_CONSTATUS
					for (i = 0; i < sizeof(ETH_CONNECT); i++)
					{
						USART1->DR = pError[i];
						/* 等待发送结束 */
						while ((USART1->SR & USART_FLAG_TC) == (uint16_t)RESET);
					}
				#endif 
			}
			/* 网线断开 */
			else
			{
				#ifdef ETH_CONSTATUS
					const char *pError = ETH_DISCONNECT;
					uint8_t i;
				#endif
				
				g_ucEthLinkStatus = 0;
				
				#ifdef ETH_CONSTATUS
					for (i = 0; i < sizeof(ETH_DISCONNECT); i++)
					{
						USART1->DR = pError[i];
						/* 等待发送结束 */
						while ((USART1->SR & USART_FLAG_TC) == (uint16_t)RESET);
					}
				#endif
				
			}
			
		}
		/* 清中断挂起位 */
		EXTI_ClearITPendingBit(EXTI_Line6);
	}
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
